In [70]:
import pandas as pd

In [71]:
from pandas import Series,DataFrame

In [122]:
import numpy as np

Series
A Series is a one-dimensional array-like object containing a sequence of values (of similar types to NumPy types) and an associated array of data labels, called its index

In [72]:
obj = pd.Series([4,7,-5,3])

In [73]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

The string representation of a Series displayed interactively shows the index on the left and the values on the right. The index for the data start from 0 -> N-1(where N is the length of the array)

In [74]:
# we are able to assign indexes to the data
obj2 = pd.Series([4,7,-5,3],index=['d','b','a','c'])

In [75]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [76]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [77]:
# can use labels in the index when the selecting single values or a set of values
obj2['a']

-5

In [78]:
obj2['d']=6

In [79]:
# this is interpreted as a list of indices, even with 
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [80]:
# can use numpy operations such as filtering with boolean
# array, scalar multiplication, or applying math functions
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [81]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [82]:
# we can check for a value inside of the series
'b' in obj2

True

In [83]:
'e' in obj2

False

In [84]:
1 in obj

True

In [85]:
6 in obj

False

In [86]:
# we can use the data contained in a python dict by creating a Series by
# passing the dict

sdata={'Ohio':35000,'Texas':71000,'Oregon':16000,'Utah':5000}

In [87]:
obj3=pd.Series(sdata)

In [88]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

when passing the dict to the series, the index is already sorted with the keys sorted. we can overide the keys by:

In [89]:
states=['California','Ohio','Oregon','Texas']

In [90]:
obj4=pd.Series(sdata,index=states)

In [91]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

the values found in sdata were placed in the appropiate locations, but since 'California' is not found so the value would show up as NaN(not a number). NaN is called the 'missing' or 'NA' value

In [92]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [93]:
pd.isna(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [94]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [95]:
pd.notna(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [96]:
# we can use initance methods
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [97]:
obj4.isna()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

A useful Series feature for many applications is that it automatically aligns by index label in arithmetic operations.

its almost the same as join in sql

In [98]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [99]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [100]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [101]:
# Series object itself and its index have a name attribute
obj4.name='population'

In [102]:
obj4.index.name='state'

In [103]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [104]:
# a Series index can be altered in-place by assignmet
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [105]:
obj.index=['Bob','Steve','Jeff','Ryan']

In [106]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [107]:
obj.index.name="name"

In [108]:
obj

name
Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [109]:
obj.name='age'

In [110]:
obj

name
Bob      4
Steve    7
Jeff    -5
Ryan     3
Name: age, dtype: int64

DataFrame
A DataFrame represents a rectangular table of data and contains an ordered collection of columns, each of which can be a different value type (numeric, string,boolean, etc.).

the dataframe has both row and column index. it can thought as a dict of Series all share the same index.

the data is stored as one or more dimensional blocks rather than a list,dict, or some other collection of one-dimensional

In [111]:
# there are many ways to construct a dataframe. we can use equal length
# lists of dict or NumPy arrays


data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada','Nevada'],
        'year':[2000,2001,2002,2001,2002,2003],
        'pop':[1.5,1.7,3.6,2.4,2.9,3.2]}

frame = pd.DataFrame(data)

In [112]:
# the datafrae will have  its index assigned automatically as the Series
# and the columns are placed in sorted order
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [113]:
# if we have a large data set we can use the .head() to get the first 5
# rows

frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [114]:
# we can specify a suquencebof columns. they are going to be 
# arrange in that order

pd.DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [115]:
# if we pass a column that is not in the dict we would get NaN in the 
# column section
frame2 = pd.DataFrame(data,columns=['year','state','pop','debt'],
                  index=['one','two','three','four','five','six'])

In [116]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [117]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [118]:
# a column in a dataframe can be retrived as a Series either 
# by dict like notation or by attribute

frame["state"]

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [119]:
# the returned Series have the same index as the DataFrame, 
# their name is appropriately set
frame.state

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [120]:
# to get the row of the set. we use .loc attribute
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [121]:
# modifying a column
frame2['debt'] = 16.5

In [123]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [124]:
frame2['debt'] = np.arange(6.)

In [125]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [126]:
# When you are assigning lists or arrays to a column, the value’s 
# length must match the length of the DataFrame. If you assign a Series, 
# its labels will be realigned exactly to the DataFrame’s index, 
# inserting missing values in any holes:

val = pd.Series([-1.2,-1.5,-1.7], index=['two','four','five'])

In [127]:
frame2['debt']=val

In [128]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [129]:
# if a column does not exist, it would create a new column
frame2['eastern'] = frame2.state == 'Ohio'

# cannot create a new column with frame2.eastern syntax

In [130]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [131]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'eastern'], dtype='object')

In [132]:
# to delete a column we can use the del keyword
del frame2['eastern']

In [133]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [134]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [135]:
# another common form of data is a nested dict of dicts
pop = {'Nevada':{2001:2.4,2002:2.9},
        'Ohio': {2000:1.5,2001:1.7, 2002:3.6}}

In [136]:
frame3 = pd.DataFrame(pop)

In [137]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [138]:
# we can transpose the DataFrame with the same syntax
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [139]:
# the keys in the inner dicts are combined and sorted to form the 
# index in the resualt
pd.DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [148]:
pdata={"Ohio":frame3['Ohio'][:-1],
    'Nevada':frame3['Nevada'][:2]}

In [149]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [150]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [151]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [152]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [153]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)